app/controllers/divisions_controller.rb

SELECT * FROM "divisions"
---
  def index
    @divisions = Division.all

SELECT * FROM "divisions" WHERE ("divisions"."id" = 1)
---
  def show
    @division = Division.find(params[:id])

INSERT INTO "divisions" ("name", "created_at", "updated_at") VALUES('Elementary', '2010-06-03 03:14:46', '2010-06-03 03:14:46')
---
  def create
    @division = Division.new(params[:division])

    respond_to do |format|
      if @division.save

SELECT "locations".* FROM "locations" INNER JOIN "teams" ON "locations".id = "teams".location_id WHERE (("teams".division_id = 2))
SELECT * FROM "divisions" WHERE ("divisions"."id" = 2)
---
  def locations
  	@locations = Division.find(params[:division]).locations