app/controllers/games_controller.rb

SELECT * FROM "games"
---
  def index
    @games = Game.all

SELECT * FROM "divisions" LIMIT 1
SELECT * FROM "divisions" WHERE ("divisions"."id" = 2)
SELECT * FROM "games" WHERE ("games"."id" = 1)
SELECT * FROM "scores" WHERE ("scores".round_id = 1)
---
  def show
  	if (params[:division].nil?)
  		@division = Division.first
  	else
  		@division = Division.find(params[:division])
  	end
    @game = Game.find(params[:id])
    @rounds = @game.rounds
	@scores = []
	@superNil = false
	@rounds.each_with_index do |round, index|
	  round.scores.each do |s|

DELETE FROM "scores" WHERE ("id" IN (1))
SELECT * FROM "teams" WHERE ("teams"."tournament_id" = 1 AND "teams"."division_id" = 1)
SELECT * FROM "teams" WHERE ("teams"."tournament_id" = 1)
SELECT * FROM "players" WHERE ("players".team_id = 4)
---
		   	end
		  end
	  else
	    @scores.delete(item)
	  end
	end
	if (@scores.length > 0 && @superNil)
		@teams = Team.find_all_by_tournament_id_and_division_id(@game.tournament.id, @division.id)
		@teams.each {|t| puts t.name}
		if (@teams.length > 1)
			@teams.sort! do |a,b|
				count = 0
				a.players.each do |p|

SELECT * FROM "games" WHERE ("games"."id" = 2)
---
  def edit
    @game = Game.find(params[:id])

INSERT INTO "games" ("name", "created_at", "category", "updated_at", "bitwise_number", "scoringModel", "tournament_id") VALUES('Propaganda', '2010-06-06 16:25:44', NULL, '2010-06-06 16:25:44', NULL, NULL, 1)
---
  def create
    @game = Game.new(params[:game])
    respond_to do |format|
      if @game.save

SELECT * FROM "games" WHERE ("games"."id" = 2)
UPDATE "games" SET "updated_at" = '2010-06-05 21:56:37', "scoringModel" = 'Table-Based' WHERE "id" = 2
---
  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])

SELECT * FROM "games" WHERE ("games"."id" = 1)
DELETE FROM "games" WHERE "id" = 1
---
  def destroy
    @game = Game.find(params[:id])
    tournament = @game.tournament
    @game.destroy

SELECT * FROM "divisions" LIMIT 1
SELECT * FROM "divisions" WHERE ("divisions"."id" = 2)
SELECT * FROM "rounds" WHERE ("rounds".game_id = 2)
SELECT * FROM "games" WHERE ("games"."id" = 2)
SELECT "players".* FROM "players" INNER JOIN "teams" ON "players".team_id = "teams".id WHERE (("teams".tournament_id = 1))
SELECT * FROM "players" WHERE ("players"."id" = 15)
SELECT * FROM "scores" WHERE ("scores"."round_id" = 5 AND "scores"."player_id" = 19) LIMIT 1
SELECT * FROM "teams" WHERE ("teams"."id" = 6)
INSERT INTO "scores" ("created_at", "round_id", "updated_at", "player_id", "score") VALUES('2010-06-06 03:40:01', 1, '2010-06-06 03:40:01', 19, NULL)
---
  def score
  	if (params[:division].nil?)
  		@division = Division.first
  	else
  		@division = Division.find(params[:division])
  	end
  	@round = Round.find(params[:round])
    @game = Game.find(params[:id])
    @players = @division.players
    @players.each do |p|
      if Score.find_by_player_id_and_round_id(p.id, @round.id).nil? && team_plays_game?(p.team, @game)
        @round.scores << Score.new(:player_id => p.id, :player => p, :round => @round, :round_id => @round.id)

INSERT INTO "rounds" ("created_at", "updated_at", "game_id") VALUES('2010-06-06 03:36:16', '2010-06-06 03:36:16', 2)
---
  def new_round
    Round.create(:game_id => params[:id])

SELECT * FROM "games" WHERE ("games"."id" = 2)
SELECT * FROM "rounds" WHERE ("rounds".game_id = 2)
SELECT * FROM "divisions" WHERE ("divisions"."id" = 1)
SELECT * FROM "seatings" WHERE ("seatings"."round_id" = '5' AND "seatings"."division_id" = '1' AND "seatings"."game_id" = '13') LIMIT 1
SELECT * FROM "teams" WHERE ("teams".division_id = 1)
SELECT * FROM "players" WHERE ("players".team_id = 6)
SELECT * FROM "seatings" WHERE ("seatings"."game_id" IS NULL AND "seatings"."division_id" IS NULL) LIMIT 1
---
  def seat
      @game = Game.find(params[:id])
      @round = Round.find(params[:round])
      @division = Division.find(params[:division])
      if @game.scoringModel == "Table"
        @currentSeat = Seating.find_by_game_id_and_division_id_and_round_id(params[:id], params[:division], params[:round])
        if @currentSeat.nil? || !(params[:regenerate].nil?)
	      if @game.rounds.index(@round) == 0
	        ####Random seating
	        numberOfPlayers = 0
	        teamsPlaying = []
	        @division.teams.each do |t|
	          if team_plays_game?(t, @game)
	            numberOfPlayers += t.players.length

INSERT INTO "seatings" ("html", "round_id", "created_at", "updated_at", "division_id", "game_id") VALUES('---
---
	       	  p.each {|a| puts a.name}
	       	end
	       	if @currentSeat.nil?
	       	  @currentSeat = Seating.create(:game_id => @game.id, :html => @tables, :round_id => @round.id, :division_id => @division.id)

SELECT * FROM "scores" WHERE ("scores"."player_id" = 23 AND "scores"."round_id" = 6) LIMIT 1
---
	            t.players.each do |player|
	              player.totScore = 0
	              @rounds.each do |round|
	                player.totScore += Score.find_by_player_id_and_round_id(player.id, round.id).score