app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT * FROM "locations"

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 2)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "created_at", "updated_at", "geo") VALUES('Forsyth County, Georgia', '2010-06-03 03:05:22', '2010-06-03 03:05:22', 'FC')

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 2)
UPDATE "locations" SET "updated_at" = '2010-06-06 18:36:59', "geo" = 'JF' WHERE "id" = 2

  def teams
	@teams = Location.find(params[:location]).teams
---
SELECT * FROM "locations" WHERE ("locations"."id" = 2)
SELECT * FROM "teams" WHERE ("teams".location_id = 2)