app/controllers/players_controller.rb

SELECT * FROM "players"
---
  def index
    @players = Player.all

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def show
    @player = Player.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def edit
    @player = Player.find(params[:id])

INSERT INTO "players" ("name", "created_at", "updated_at", "division_id", "location_id", "team_id") VALUES('Abhinov', '2010-06-03 03:36:49', '2010-06-03 03:36:49', 1, 1, 2)
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save

SELECT * FROM "players" WHERE ("players".team_id = 4)
UPDATE "players" SET "updated_at" = '2010-06-06 04:08:46', "name" = 'Dustin Wright', "team_id" = 4 WHERE "id" = 20
---
  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])

SELECT * FROM "players" WHERE ("players"."id" = 9)
DELETE FROM "players" WHERE "id" = 9
---
  def destroy
    @player = Player.find(params[:id])
    @player.destroy