app/controllers/teams_controller.rb

SELECT * FROM "teams" WHERE ("teams".tournament_id = 1)
SELECT * FROM "tournaments" WHERE ("tournaments"."id" = 1)
---
  def index
  	if (params[:id].nil?)
      @teams = Team.all
    else
      @teams = Tournament.find(params[:id]).teams

SELECT * FROM "teams" WHERE ("teams"."id" = 1)
---
  def show
    @team = Team.find(params[:id])

SELECT * FROM "teams" WHERE ("teams"."id" = 1)
---
  def edit
    @team = Team.find(params[:id])

INSERT INTO "teams" ("name", "bitwise_games_played", "created_at", "updated_at", "division_id", "tournament_id", "location_id") VALUES('Prop my Ganda', 5, '2010-06-06 16:51:38', '2010-06-06 16:51:38', 1, 1, 1)
---
  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save

SELECT * FROM "teams" WHERE ("teams"."id" = 1)
UPDATE "teams" SET "updated_at" = '2010-06-05 19:55:09', "division_id" = 1, "name" = 'Team #1' WHERE "id" = 4
---
  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.update_attributes(params[:team])

SELECT * FROM "teams" WHERE ("teams"."id" = 1)
DELETE FROM "teams" WHERE "id" = 1
---
  def destroy
    @team = Team.find(params[:id])
    @team.destroy