app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.all
---
SELECT * FROM "tournaments"

  def show
    @tournament = Tournament.find(params[:id])
---
SELECT * FROM "tournaments" WHERE ("tournaments"."id" = 1)

  def create
    @tournament = Tournament.new(params[:tournament])

    respond_to do |format|
      if @tournament.save
---
INSERT INTO "tournaments" ("location", "created_at", "updated_at", "year") VALUES('Cincinnati', '2010-06-03 03:04:52', '2010-06-03 03:04:52', '2010')